Autodesk.Revit.DB.ElementReferenceType
Element reference types.

Autodesk.Revit.DB.ElementReferenceType.REFERENCE_TYPE_SUBELEMENT
The reference is to a subelement.

Autodesk.Revit.DB.ElementReferenceType.REFERENCE_TYPE_MESH
The reference is to a mesh.

Autodesk.Revit.DB.ElementReferenceType.REFERENCE_TYPE_CUT_EDGE
The reference is to a face that was cut (where the original pick was made on the cut edge).

Autodesk.Revit.DB.ElementReferenceType.REFERENCE_TYPE_INSTANCE
The reference is an instance of a symbol.

Autodesk.Revit.DB.ElementReferenceType.REFERENCE_TYPE_FOREIGN
The reference is to geometry or elements in linked Revit file.

Autodesk.Revit.DB.ElementReferenceType.REFERENCE_TYPE_SURFACE
The reference is to a face or face region.

Autodesk.Revit.DB.ElementReferenceType.REFERENCE_TYPE_LINEAR
The reference is to a curve or edge.

Autodesk.Revit.DB.ElementReferenceType.REFERENCE_TYPE_NONE
The reference is to an element.